YanKE01/micropython/ports/esp32/boards/ESP32_GENERIC_P4/mpconfigboard.h
// Both of these can be set by mpconfigboard.cmake if a BOARD_VARIANT is
// specified.

#ifndef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME "Generic ESP32P4 module"
#endif

#ifndef MICROPY_HW_MCU_NAME
#define MICROPY_HW_MCU_NAME "ESP32P4"
#endif

#ifdef MICROPY_OPENMV
#undef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME               "OpenMV ESP32P4"
#define MICROPY_HW_USB_VID                  (0x37C5)
#define MICROPY_HW_USB_PID                  (0x1204)
#define MICROPY_HW_USB_PID_CDC              (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_MSC              (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC_MSC          (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_MANUFACTURER_STRING  "OpenMV"
#define MICROPY_HW_USB_PRODUCT_FS_STRING    "OpenMV ESP32P4"
#endif

#define MICROPY_PY_ESPNOW                (0)

#define MICROPY_HW_ENABLE_SDCARD            (1)

#ifndef USB_SERIAL_JTAG_PACKET_SZ_BYTES
#define USB_SERIAL_JTAG_PACKET_SZ_BYTES (64)
#endif

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL     (1)

#define MICROPY_PY_MACHINE_I2S          (1)

// Disable Wi-Fi and Bluetooth by default, these are re-enabled in the WIFI variants
#ifndef MICROPY_PY_NETWORK_WLAN
#define MICROPY_PY_NETWORK_WLAN         (0)
#endif
#ifndef MICROPY_PY_BLUETOOTH
#define MICROPY_PY_BLUETOOTH            (0)
#endif
